# Question 1
# Gina Huh

## Part 1: Show Number of Rows

In [10]:
import pandas as pd
import numpy as np
import seaborn as sns
import numbers
import csv, json

In [2]:
# Read csv file
data = pd.read_csv('data.csv')

In [3]:
# Show first 5 rows of the 'data' dataframe
data.head()

   Year  Rank           Company  Revenue (in millions) Profit (in millions)
0  1955     1    General Motors                 9823.5                  806
1  1955     2       Exxon Mobil                 5661.4                584.8
2  1955     3        U.S. Steel                 3250.4                195.4
3  1955     4  General Electric                 2959.1                212.6
4  1955     5            Esmark                 2510.8                 19.1

In [4]:
# Print the number of rows in the data frame (rows,columns)
print('There are ', data.shape[0], ' rows in the original data csv file.')

There are  25500  rows in the original data csv file.

### **Answer 1**: 25,500 rows

## Part 2: Remove Non-numeric Rows in Profit Column

In [5]:
# Show unique values in the 'Profit' column
data['Profit (in millions)'].unique

<bound method Series.unique of 0           806
1         584.8
2         195.4
3         212.6
4          19.1
5          18.5
6           1.6
7         182.8
8         183.8
9         344.4
10        132.8
11        117.2
12         84.6
13        226.1
14         55.8
15        121.1
16         37.4
17        211.9
18         48.1
19           37
20         91.6
21         36.3
22         40.5
23         89.8
24         40.5
25         36.2
26         52.3
27         52.9
28         43.7
29         76.2
          ...
25470     306.4
25471     359.9
25472     235.8
25473    -118.5
25474     131.9
25475      14.9
25476     409.1
25477       257
25478     137.1
25479     -2165
25480     215.6
25481    -181.9
25482     192.4
25483     111.6
25484       524
25485      N.A.
25486       188
25487     331.2
25488      64.9
25489        49
25490      -458
25491       154
25492      71.8
25493       328
25494    -567.6
25495       493
25496     175.4
25497      57.8
25498      70.6
25499       584
Name: Profit (in millions), Length: 25500, dtype: object>

In [6]:
# Convert all non-numeric values to null (nan)
data['Profit (in millions)'] = pd.to_numeric(data['Profit (in millions)'], errors='coerce')

In [114]:
# How many null values are there in total? 
data.isna().sum()

Year                       0
Rank                       0
Company                    0
Revenue (in millions)      0
Profit (in millions)     369
dtype: int64

In [7]:
# Drop all rows with null(nan) values
data_cut = data.dropna()

In [8]:
# Print the number of rows in the data after dropping non-numeric
print('There are ', data_cut.shape[0], 'rows after dropping non-numeric values in the profit column.')

There are  25131 rows after dropping non-numeric values in the profit column.

### **Answer 2**: 25,131 rows

## Part 3: Write Data to JSON File

In [19]:
# Set the index to 'Year' column
data_cut = data_cut.set_index('Year')

In [22]:
# Convert data_cut into csv file
data_cut.to_csv('data_cut.csv')

In [23]:
# Open files 
csvfile = open('data_cut.csv', 'r')
jsonfile = open('data2.json', 'w')

# Columns that need to be read/written
columns = ('Year', 'Rank','Company','Revenue (in millions)', 'Profit (in millions)')

# Maps information in each row to a dict
reader = csv.DictReader(csvfile, columns)

# Write each row to the JSON file
for row in reader:
    json.dump(row, jsonfile)
    jsonfile.write('\n')

## Part 4: Show Top 20 Rows with Highest Profit Values

In [24]:
# Order data based on profit
data_sorted = data_cut.sort_values(by=['Profit (in millions)'], ascending=False)

### Answer 3:

In [26]:
# Print top 20 rows with highest profits values
data_sorted.head(20)

,Rank,Company,Revenue (in millions),Profit (in millions)
Year,,,,
2005,2,Exxon Mobil,270772.0,25330.0
1999,2,Ford Motor,144416.0,22071.0
2004,2,Exxon Mobil,213199.0,21510.0
2004,8,Citigroup,94713.0,17853.0
2001,1,Exxon Mobil,210392.0,17720.0
2005,8,Citigroup,108276.0,17046.0
2005,5,General Electric,152363.0,16593.0
2002,2,Exxon Mobil,191581.0,15320.0
2003,6,Citigroup,100789.0,15276.0
2004,5,General Electric,134187.0,15002.0
2005,18,Bank of America Corp.,63324.0,14143.0
2002,7,Citigroup,112022.0,14126.0
2003,5,General Electric,131698.0,14118.0
2002,6,General Electric,125913.0,13684.0
2001,6,Citigroup,111826.0,13519.0
2005,6,ChevronTexaco,147967.0,13328.0
2001,5,General Electric,129853.0,12735.0
2001,10,Verizon Communications,64707.0,11797.0
2003,3,Exxon Mobil,182466.0,11460.0
2005,24,Pfizer,52921.0,11361.0

## Functions for Part 1 - Part 4

Modularity is important in coding, so I created separate functions for each functionality (parts 1 through 4). Modular programming makes it easier to re-use code and also allows development to be divded based on functionality. Also, programming errors are easier to detect.

In [44]:
def show_rows(df):
    print('There are ', df.shape[0], ' rows in the data.', '\n')
    
def drop_rows(df):
    
    # Convert all non-numeric values to null (nan)
    df['Profit (in millions)'] = pd.to_numeric(df['Profit (in millions)'], errors='coerce')
    
    # Drop all rows with null(nan) values
    data_cut = df.dropna()
    
    print('After dropping non-numeric rows:')
    show_rows(data_cut)
    
    return data_cut
    
def to_json(df):
    
    # Set the index to 'Year' column
    data_cut = df.set_index('Year')
    
    # Convert data_cut into csv file
    data_cut.to_csv('data_cut.csv')
    
    # Open files 
    csvfile = open('data_cut.csv', 'r')
    jsonfile = open('data2.json', 'w')

    # Columns that need to be read/written
    columns = ('Year', 'Rank','Company','Revenue (in millions)', 'Profit (in millions)')

    # Maps information in each row to a dict
    reader = csv.DictReader(csvfile, columns)

    # Write each row to the JSON file
    for row in reader:
        json.dump(row, jsonfile)
        jsonfile.write('\n')
        
    print('The csv file has been converted to a json file.', '\n')

def top_20(df):
    
    # Order data based on profit
    data_sorted = df.sort_values(by=['Profit (in millions)'], ascending=False)
    
    # Print top 20 rows with highest profits values
    print('Here are the top 20 rows with highest profit values: ', '\n', data_sorted.head(20))

In [45]:
def main():
    # Read csv file
    data = pd.read_csv('data.csv')
    
    # Part 1
    show_rows(data)
    
    # Part 2
    data_cut = drop_rows(data)
    
    # Part 3
    to_json(data_cut)
    
    #Part 4
    top_20(data_cut)

In [46]:
main()

There are  25500  rows in the data.

After dropping non-numeric rows:
There are  25131  rows in the data.

The csv file has been converted to a json file.

Here are the top 20 rows with highest profit values:
        Year  Rank                 Company  Revenue (in millions)  \
25001  2005     2             Exxon Mobil               270772.0
22001  1999     2              Ford Motor               144416.0
24501  2004     2             Exxon Mobil               213199.0
24507  2004     8               Citigroup                94713.0
23000  2001     1             Exxon Mobil               210392.0
25007  2005     8               Citigroup               108276.0
25004  2005     5        General Electric               152363.0
23501  2002     2             Exxon Mobil               191581.0
24005  2003     6               Citigroup               100789.0
24504  2004     5        General Electric               134187.0
25017  2005    18   Bank of America Corp.                63324.0
23506  2002     7               Citigroup               112022.0
24004  2003     5        General Electric               131698.0
23505  2002     6        General Electric               125913.0
23005  2001     6               Citigroup               111826.0
25005  2005     6           ChevronTexaco               147967.0
23004  2001     5        General Electric               129853.0
23009  2001    10  Verizon Communications                64707.0
24002  2003     3             Exxon Mobil               182466.0
25023  2005    24                  Pfizer                52921.0

       Profit (in millions)
25001               25330.0
22001               22071.0
24501               21510.0
24507               17853.0
23000               17720.0
25007               17046.0
25004               16593.0
23501               15320.0
24005               15276.0
24504               15002.0
25017               14143.0
23506               14126.0
24004               14118.0
23505               13684.0
23005               13519.0
25005               13328.0
23004               12735.0
23009               11797.0
24002               11460.0
25023               11361.0